#!/usr/bin/env python3


# מגדירים פונקציה בשם login (יוצרים בלוק קוד שאפשר להפעיל)
def login():

    # input = קלט מהמשתמש (מחכה שתקליד משהו)
    # הטקסט בתוך הסוגריים זה מה שמוצג
    # username = שומר את מה שהמשתמש הקליד בתוך משתנה
    username = input("Enter username: ")

    # אותו דבר לסיסמה – קלט מהמשתמש ושמירה במשתנה password
    password = input("Enter password: ")

    # if = תנאי (בדיקה)
    # username == "admin" → בודק אם המשתנה שווה למחרוזת "admin"
    # and = וגם (שני התנאים חייבים להיות נכונים)
    if username == "admin" and password == "1234":

        # print = פלט למסך (מדפיס למשתמש)
        # זה קורה רק אם התנאי למעלה נכון
        print("Success")

    else:
        # else = אחרת (אם התנאי לא התקיים)
        # כלומר אחד מהם או שניהם לא נכונים
        print("Fail")


# כאן אנחנו קוראים לפונקציה (מפעילים אותה בפועל)
# בלי השורה הזאת – שום דבר לא ירוץ
login()
